Repository: maieuto/Newstori
Catalog: HyperlocalNews/Resx/AppResources.*.resx
Languages: cy

# IntroText
source: Got news? Share it! Tell your community news service what's going on near you. Share reports, photos and events and help to keep your community connected.
cy: Oes gennych chi newyddion? Rhannwch e! Dywedwch wrth eich gwasanaeth newyddion cymunedol beth sy'n digwydd yn eich hardal chi. Rhannwch adroddiadau, lluniau a digwyddiadau a helpwch eich cymuned i gadw mewn cysylltiad.

# ConnectionErrorLabel
source: Connection Error - Could not connect to Newstori server at this time, please try again.
cy: Cywiriad Cyswllt - ni allem gysylltu â gweinydd Newstori ar hyn o bryd, ceisiwch eto os gwelwch yn dda

# SignUpLabel
source: New to Newstori? Sign up
cy: Newydd i Newstori? Cofrestrwch

# LoginLabel
source: Already a user? Login
cy: Yn ddefnyddiwr eisoes? Mewngofnodwch

# TermsConditionsLabel
source: Terms & Conditions
cy: Telerau ac amodau

# TermsConditionsText
source: T&C text
cy: Tects y telerau ac amodau

# JoinLabel
source: Join
cy: Ymuno

# StartLabel
source: Start
cy: Dechrau

# FullNameLabel
source: Full name
cy: Enw llawn

# EmailLabel
source: Email
cy: E-bost

# ReportSubmittedTitle
source: Report Submitted
cy: Adroddiad wedi'i anfon

# ReportSubmittedLabel
source: Your report has been submitted
cy: mae'ch adroddiad wedi'i anfon

# ReportSavedTitle
source: Report Saved
cy: Arbedwyd yr Adroddiad

# ReportSavedLabel
source: Your report has been saved to drafts
cy: Arbedwyd yr adroddiad i ffeil drafft

# LocationNeededTitle
source: Could not submit
cy: Ni ellid cyflwyno

# LocationNeededLabel
source: Reports require a location to be submitted
cy: Mae adroddiadau angen lleoliad i gael eu cyflwyno

# SubmissionFailedTitle
source: Submission Failed
cy: Methodd y Cyflwyno

# SubmissionFailedLabel
source: We're sorry, your report could not be submitted because:
cy: Mae'n ddrwg gennym ni ellir cyflwyno eich adroddiad oherwydd:

# DiscardLabel
source: Discard
cy: Gwared

# NewReportLabel
source: New Report
cy: Adroddiad newydd

# SubmitLabel
source: Submit
cy: Cyflwyno

# SubmitLabelAlternative
source: Submit
cy: Anfon

# DoneLabel
source: Done
cy: Wedi'i wneud

# SaveAsDraftLabel
source: Save As Draft
cy: Arbed fel draft

# ConfirmLabel
source: Confirm
cy: Cadarnhau

# PreferredLanguageLabel
source: Preferred Language
cy: Dewis Iaith

# ProfileUpdateAlertTitle
source: Profile Updated
cy: Diweddaru proffil

# ProfileUpdateAlertLabel
source: Your profile has been updated
cy: Mae eich proffil wedi ei ddiweddaru

# ProfileUpdateAlertTitleREVERSE
source: Diweddaru proffil
cy: Profile Updated

# ProfileUpdateAlertLabelREVERSE
source: Mae eich proffil wedi ei ddiweddaru
cy: Your profile has been updated

# OKLabelREVERSE
source: Iawn
cy: OK

# UpdateLabel
source: Update
cy: Diweddariad

# UpdateFailedTitle
source: Update Failed
cy: Methu diweddaru

# UpdateFailedLabel
source: We're sorry, your profile could not be updated at this time because:
cy: Mae'n ddrwg gennym ond dyw hi ddim yn bosib diweddaru eich proffil ar hyn o bryd.

# BackLabel
source: Back
cy: Yn ôl

# OKLabel
source: OK
cy: Iawn

# SelectHyperlocalLabel
source: Select news service
cy: Dewisiwch wasaneth newyddion

# VerificationAlertTitle
source: Verifcation Request Processed
cy: Cais am wirio wedi ei brosesu

# VerificationAlertLabel
source: Check your emails User verification requested
cy: Edrychwch ar eich ebyst. Gwiriad o'r defnyddiwr wedi ei archebu

# GuideLabel
source: Report Guide
cy: Canllaw gohebu

# ExportLabel
source: Export
cy: Allforio

source: User Feedback Response
cy: Adborth defnyddiwr

# JoinButtonLabel
source: Complete
cy: Wedi'i gwblhau

# ClaimButtonLabel
source: Claim
cy: Derbyn

# DeclinedButtonLabel
source: Decline
cy: Gwrthod

# ClaimedPrefix
source: Claimed by:
cy: Derbyniwyd gan:

# ClaimedString
source: Claimed
cy: Wedi'i berchnogi

# DeclinedString
source: Declined
cy: Wedi'i wrthod

# HyperlocalDescriptionText
source: You can now choose to help a local news service by sending them your news. It's really easy. We've listed all the community news services registered in your area. Select one from the list below to send your news directly to them.
cy: Gallwch nawr ddewis helpu gwasanaeth newyddion lleol drwy yrru eich newyddion atynt. Mae’n hawdd iawn. Rydym wedi rhestru’r holl wasanaethau newyddion cymunedol sydd wedi cofrestru yn eich ardal. Dewiswch un o’r rhestr isod a gyrrwch eich newyddion yn syth atynt.

# RegisterHyperlocalDescriptionText
source: Once you have submitted the details of your community news service, these will be verified by the Centre for Community Journalism.
cy: Unwaith y byddwch wedi cyflwyno manylion eich gwasanaeth newyddion cymunedol, caiff y rhain eu gwirio gan y Ganolfan Newyddiaduraeth Gymunedol.

# RegisterNewHyperlocalSuggestion
source: No community news services registered in your area? Find out how you can start your own
cy: Dim gwasanaethau newyddion cymunedol wedi’u cofrestru yn eich ardal? Canfyddwch sut i ddechrau un eich hun

# RegisterNewHyperlocalSuggestionHTML
source: <html style="background:#dddddd"><body style="background:#dddddd"><p style="font-size:small; color:black;">No community news services registered in your area? Find out how you can start your own: <a href="http://www.communityjournalism.co.uk">www.communityjournalism.co.uk</a></p></body></html>
cy: <html style="background:#dddddd"><body style="background:#dddddd"><p>Dim gwasanaethau newyddion cymunedol wedi’u cofrestru yn eich ardal? Canfyddwch sut i ddechrau un eich hun <a href="http://www.communityjournalism.co.uk">www.communityjournalism.co.uk</a></p></body></html>

# HyperlocalTitle
source: Your community news service
cy: Eich gwasanaeth newyddion cymunedol

# NewsSendTitle
source: I want to send news to...
cy: Rwyf eisiau anfon newyddion at...

# RecoverTitle
source: Login
cy: Adfer

# RecoverTitleAlt
source: Login
cy: Mewngofnodi

# RecoveryEmailText
source: We will now send you an email so that you can login to Newstori.
cy: Danfonwn e-bost i chi nawr i fewngofnodi i Newstori.

# FeedbackLabel
source: Feedback
cy: Adborth

# DraftsLabel
source: Drafts
cy: Drafftiau

# SentLabel
source: Sent
cy: Anfon

# ProfileLabel
source: Profile
cy: Proffil

# MeLabel
source: Me
cy: Fi

# ReportLabel
source: Report
cy: Adroddiad

# RequestLabel
source: Request
cy: Gofyn

# HeadlineLabel
source: What's the Headline?
cy: Beth yw’r pennawd?

# StoryCopyLabel
source: Tell us more (and please provide your name)
cy: Dywedwch ragor wrthym (a darparwch eich enw, os gwelwch yn dda)

# ReportGuidelinesText
source: What information should I include in my news story? Your community news service needs the 5 'W's: When? Where? Who? What? Why? If you can include names and quotes that is even better - but don't worry if you miss anything. Your chosen community news service may get in touch to ask you for more details later on.
cy: Pa wybodaeth ddylwn i gynnwys yn fy stori newyddion? Mae angen ateb pum cwestiwn: Pryd? Ble? Pwy? Beth? Pam? Os gallwch gynnwys enwau a dyfyniadau, gorau oll, ond peidiwch a poeni os nad. Gall rywun o'ch gwasanaeth newyddion cymunedol gysylltu â chi am fwy o fanylion yn nes ymlaen os oes angen.

# AdditionalInformationLabel
source: For your story, could you give date/time, photo and where it happened?
cy: Allwch chi roi dyddiad/amser, llun a lle y digwyddodd y stori?

# PhotoLabel
source: Photo
cy: Llun

# DateTimeLabel
source: Date/Time
cy: Dyddiad

# LocationLabel
source: Location
cy: Lleoliad

# SendToLabel
source: Send To
cy: Anfon at

# NearbyHyperlocalLabel
source: Nearest community news services
cy: Gwasanaethau newyddion cymunedol agosaf

# SendToLabelCombined
source: Send to nearest community news services
cy: Anfon at gwasanaethau newyddion cymunedol agosaf

# YourHyperlocalLabel
source: Your chosen community news service
cy: Eich gasanaeth newyddion cymunedol o ddewis

# PatchPaperDescriptionLabel
source: Your patch paper is... your home community news service that you will post to most frequently, and may want to post to even when you are away from home. This may be the community news service you are loyal to or read most often. Use this option when you want to override the geolocation service.
cy: Eich papur ardal yw'r gwasanaeth newyddion cymunedol lleol lle byddwch yn anfon straeon amlaf - efallai hyd yn oed pan fyddwch oddi cartref. Hwn yw'r gwasanaeth newyddion cymunedol rydych chi fwyaf triw iddo neu'n ei ddarllen amlaf. Defnyddiwch y dewis hwn pan fyddwch eisiau osgoi'r gwasanaeth geo-leoliad sydd yn anfon cynnwys at y gwasaneth agosaf yn awtomatic.

# JoinHyperlocalLabel
source: Join a community news service
cy: Ymunwch â gwasanaeth newyddion cymunedol

# RegisterHyperlocalLabel
source: Register a community news service
cy: Cofrestru gwasanaeth newyddion cymunedol

# HyperlocalNameLabel
source: Community news service name
cy: Enw'r gwasanaeth newyddion cymunedol

# HyperlocalSearchLabel
source: Search
cy: Chwilio

# LocationLabel2
source: Location
cy: Lleoliad

# AdministrationEmailLabel
source: Email
cy: E-bost

# RegisterHyperlocalText
source: Register Hyperlocal text (displayed on view)
cy: Cofrestru tecst newyddion cymunedol (cael ei ddangos ar goedd)

# EmailVerificationText
source: Email Verification Text (sent out via webservice)
cy: Tecst gwirio ebost (wedi ei anfon trwy wasanaeth y we)

# ReportTitleLabel
source: Report Title
cy: Teitl yr adroddiad

# ExportTitleLabel
source: Export
cy: Symyd allan

# SendLabel
source: Send
cy: Anfon

# TeamMessageLabel
source: Message
cy: Neges

# TeamMessageText
source: Message from the team
cy: Neges gan y tîm

# YourReplyLabel
source: Your Reply
cy: Eich ateb

# AdditionalLabel
source: Additonal
cy: Ychwanegol

# SendFeedbackLabel
source: Send Feedback
cy: Anfonwch Adborth

# FeedbackSendTitle
source: Feedback Sent
cy: Anfonwyd Adborth

# FeedbackSentLabel
source: Your feedback has been sent
cy: Anfonwyd eich Adborth

# FeedbackFailedTitle
source: Feedback Failed
cy: Bu'r adborth yn aflwyddiannus

# FeedbackFailedLabel
source: We're sorry, your feedback could not be sent at this time. Please check your connection.
cy: Mae'n ddrwg gennym, ni ellid anfon eich adborth y tro hwn. Gwiriwch eich cysylltiad os gwelwch yn dda.

# ArticleExplortedTitle
source: Article Exported
cy: Allforiwyd yr Erthygl

# ArticleExplortedLabel
source: The article has been sent to your email address.
cy: Anfonwyd yr erthygl i'ch cyfeiriad e-bost.

# ArticleExplortFailedTitle
source: Article Export Failed
cy: Methwyd ag Allforio'r Erthygl

# ArticleExplortFailedLabel
source: The article could not be exported.
cy: Ni allwyd allforio'r erthygl

# ArticleClaimRemovedTitle
source: Article Claim Removed
cy: Symudwyd Hawl ar yr Erthygl

# ArticleClaimRemovedLabel
source: You have removed your claim on this article
cy: Rydych wedi symud eich hawl ar yr erthygl hon

# ArticleClaimedTitle
source: Article Claimed
cy: Hawliwyd yr Erthygl

# ArticleClaimedLabel
source: You have claimed this article.
cy: Rydych wedi hawlio'r erthygl hon

# ArticleClaimFailedTitle
source: Article Claim Failed
cy: Methodd Hawlio'r Erthygl

# ArticleClaimFailedLabel
source: The article could not be claimed because:
cy: Ni ellid hawlio'r erthygl oherwydd:

# ArticleUndeclinedTitle
source: Article undeclined
cy: Dad-wrthodwyd yr erthygl

# ArticleUndeclinedLabel
source: You have undeclined this article
cy: Rydych wedi dad-wrthod yr erthygl hon

# ArticleDeclinedTitle
source: Article declined
cy: Gwrthodwyd yr erthygl

# ArticleDeclinedLabel
source: You have declined this article
cy: Rydych wedi gwrthod yr erthygl hon

# ArticleDeclineFailedTitle
source: Article Decline Failed
cy: Methwyd â Gwrthod yr Erthygl

# ArticleDeclineFailedLabel
source: The article could not be declined because:
cy: Ni ellid gwrthod yr erthygl oherwydd:

# CannotRegisterTitle
source: Cannot Register
cy: Methu Cofrestru

# CannotRegisterLabel
source: Please provide a location in order to register your hyperlocal
cy: Darparwch leoliad er mwyn cofrestru eich newyddion cymunedol lleol

# RegistrationRequestedTitle
source: Registration Requested
cy: Gofynnwyd am Gofrestru

# RegistrationRequestedLabel
source: Your Hyperlocal Registration has been successful and is now pending verification
cy: Bu eich Cofrestru Newyddion Cymunedol Lleol yn llwyddiannus ac mae nawr yn disgwyl ei ddilysu

# RegistrationRequestFailedTitle
source: Registration Failed
cy: Methwyd â Chofrestru

# RegistrationRequestFailedLabel
source: We could not register your Hyperlocal because:
cy: Ni allem gofrestru eich newyddion cymunedol lleol heddiw oherwydd:

# VerificationRequestedTitle
source: Verification Requested
cy: Cais Dilysu

# VerificationRequestedLabel
source: Your request has been sent, check your emails.
cy: Anfonwyd eich cais, gwiriwch eich e-bost

# VerificationRequestFailedTitle
source: Verification Request Failed
cy: Methodd y Cais Dilysu

# VerificationRequestFailedLabel
source: We could not request a verification of your account because:
cy: Ni allem ofyn am ddilysu eich cyfrif oherwydd:

# UserVerificationRequestProcessedTitle
source: User Verification Request Processed
cy: Proseswyd eich Cais am Ddilysu Defnyddiwr

# UserVerificationRequestProcessedLabel
source: Check your emails
cy: Gwiriwch eich e-bost

# UserVerificationRequestFailedTitle
source: User Verification Request Failed
cy: Methodd y Cais Dilysu Defnyddiwr

# UserVerificationRequestFailedLabel
source: We could not complete your request because:
cy: Ni allem gwblhau eich cais oherwydd:

# ProfileUpdatedTitle
source: Profile Updated
cy: Diweddaru Proffil

# ProfileUpdatedLabel
source: Your profile has been updated
cy: Diweddarwyd eich Proffil

# ProfileUpdatedTitleREVERSE
source: Diweddaru Proffil
cy: Profile Updated

# ProfileUpdatedLabelREVERSE
source: Diweddarwyd eich Proffil
cy: Your profile has been updated

# ProfileUpdateFailedTitle
source: Update Failed
cy: Methodd y Diweddariad

# ProfileUpdateFailedLabel
source: We're sorry, your profile could not be updated at this time.
cy: Mae'n ddrwg gennym, ni allwyd diweddaru eich proffil ar hyn o bryd

# UserRegistrationFailedTitle
source: Registration Failed
cy: Methodd y Cofrestru

# UserRegistrationFailedLabel
source: We could not register your account because:
cy: Ni allem gofrestru eich cyfrif oherwydd:

# UserLoginFailReason
source: Email address invalid or already exists in users table
cy: Cyfeiriad e-bost annilys neu eisoes yn nhabl defnyddwyr

# FeedbackResponseFailedTitle
source: Response Failed
cy: Methodd yr Ymateb

# FeedbackResponseFailedLabel
source: We're sorry, your response could not be sent at this time because:
cy: Mae'n ddrwg gennym, ni allem yrru ymateb ar hyn o bryd oherwydd:

# FeedbackResponseSentTitle
source: Response Sent
cy: Anfonwyd Ymateb

# FeedbackResponseSentLabel
source: Your response has been sent.
cy: Anfonwyd eich ymateb

# UserVerifyScreenTitle
source: Verification Request Failed
cy: Methodd y Cais Dilysu

# UserVerifyScreenMessage
source: You must supply a valid confirmation token
cy: Rhaid i chi roi tocyn cadarnhad dilys
